In [2]:
import pandas as pd
import numpy as n

### 경제적 요인: 성별 임금

In [2]:
df_e_1 = pd.read_csv("./data/경제_성별_임금_및_근로시간.csv")
df_e_1.head()

,고용형태,성별,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,고용형태,성별,월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원),월임금총액 (천원)
1,전체근로자,전체,2069,2178,2279,2277,2326,2428,2527,2617,2700,2740,2833,2896,3028,3138,3180,3271,3526,3640
2,전체근로자,남,2451,2570,2700,2691,2754,2869,2974,3095,3218,3269,3364,3433,3569,3682,3722,3833,4127,4260
3,전체근로자,여,1413,1524,1583,1588,1633,1714,1815,1873,1925,1944,2040,2112,2259,2371,2408,2476,2683,2783

### 경제적 요인: 성별 고용률

In [3]:
df_e_2 = pd.read_csv("./data/경제_성별_고용률.csv")
df_e_2.head()

,성별,2023.11,2023.11.1,2023.12,2023.12.1,2024.01,2024.01.1,2024.02,2024.02.1,2024.03,...,2019,2019.1,2020,2020.1,2021,2021.1,2022,2022.1,2023,2023.1
0,성별,15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),...,15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%),15세이상인구 (천명),고용률 (%)
1,계,45476.1,63.1,45505,61.7,45513.5,61,45525.2,61.6,45529.2,...,44503.7,60.9,44785,60.1,45080,60.5,45260.1,62.1,45407.1,62.6
2,남자,22402.9,71.7,22424.1,70.6,22428.9,69.8,22435.2,70.2,22435.5,...,21886.2,70.7,22035.4,69.8,22198.3,70,22272.5,71.5,22361.9,71.3
3,여자,23073.2,54.8,23080.8,53.1,23084.6,52.4,23090,53.3,23093.7,...,22617.5,51.6,22749.6,50.7,22881.7,51.2,22987.7,52.9,23045.2,54.1

### 경제적 요인: 주택 종합 매매가격 지수

In [5]:
df_e_3 = pd.read_csv("./data/경제_유형별_매매가격지수.csv")
df_e_3.head()

,주택유형별(1),지역별(1),2003.11,2003.12,2004.01,2004.02,2004.03,2004.04,2004.05,2004.06,...,2024.01,2024.02,2024.03,2024.04,2024.05,2024.06,2024.07,2024.08,2024.09,2024.10
0,종합,전국,61.45182367,60.96318451,60.65200906,60.74382884,60.84237569,60.9356494,60.91667267,60.75195248,...,96.040180,95.901927,95.786831,95.737909,95.717351,95.754276,95.899806,96.129145,96.296186,96.367141
1,종합,수도권,55.76553796,55.35919486,55.11643742,55.22895808,55.37644837,55.51144288,55.45855503,55.24562438,...,95.430554,95.285778,95.183774,95.172776,95.187721,95.364552,95.748736,96.260693,96.637514,96.847183
2,종합,지방,68.35885551,67.76079683,67.35650033,67.416319,67.44192704,67.47331005,67.50345037,67.41157398,...,96.590996,96.458992,96.331473,96.246498,96.192204,96.096392,96.016345,95.979948,95.950713,95.892347
3,종합,6대광역시,60.55593086,59.92299148,59.5571615,59.57450359,59.6360414,59.6859551,59.67871939,59.55195436,...,92.405391,92.219113,92.049402,91.937351,91.857327,91.735348,91.650747,91.653137,91.639758,91.552897
4,종합,5대광역시,61.78013951,61.11991671,60.74473828,60.78754247,60.8920685,60.9486107,60.97005881,60.87234739,...,91.916167,91.703139,91.499813,91.367441,91.242792,91.045084,90.874595,90.756014,90.679764,90.545600

### 경제적 요인: 주택 종합 전세가격 지수

In [6]:
df_e_4 = pd.read_csv("./data/경제_유형별_전세가격지수.csv")
df_e_4.head()

,주택유형별(1),지역별(1),2003.11,2003.12,2004.01,2004.02,2004.03,2004.04,2004.05,2004.06,...,2024.01,2024.02,2024.03,2024.04,2024.05,2024.06,2024.07,2024.08,2024.09,2024.10
0,종합,전국,60.35291842,59.5753307,59.20969127,59.30727005,59.46695411,59.51404133,59.36242596,58.81942657,...,92.545345,92.569724,92.614448,92.676776,92.791262,92.897805,93.049697,93.249924,93.423252,93.575502
1,종합,수도권,54.17575409,53.38138805,52.99816434,53.07850316,53.24412204,53.24946746,53.02534591,52.44592437,...,90.317980,90.440706,90.612546,90.799050,91.055237,91.333094,91.697985,92.123919,92.493296,92.799639
2,종합,지방,67.24085794,66.51831499,66.19328531,66.31275478,66.45765304,66.56459847,66.52589603,66.05753691,...,94.597705,94.525311,94.445241,94.385968,94.362036,94.301847,94.247276,94.229711,94.214722,94.219491
3,종합,6대광역시,61.23098145,60.42303315,59.92438972,59.96783798,60.11061489,60.17601697,60.0219674,59.56802015,...,88.667508,88.634339,88.658040,88.694780,88.771373,88.791084,88.798439,88.925398,89.036554,89.156293
4,종합,5대광역시,62.91387205,62.11468545,61.64905065,61.71753435,61.88707018,61.98627076,61.87555232,61.39557816,...,88.822809,88.714055,88.628134,88.593466,88.564285,88.479196,88.395291,88.358706,88.322705,88.320415

### 사회적 요인: 시도별 평균 초혼 연령

In [7]:
df_s_1 = pd.read_csv("./data/사회_시도별_평균초혼연령.csv")
df_s_1.head()

,시도별,2000,2000.1,2001,2001.1,2002,2002.1,2003,2003.1,2004,...,2019,2019.1,2020,2020.1,2021,2021.1,2022,2022.1,2023,2023.1
0,시도별,남편,아내,남편,아내,남편,아내,남편,아내,남편,...,남편,아내,남편,아내,남편,아내,남편,아내,남편,아내
1,전국,29.28,26.49,29.55,26.78,29.77,27.01,30.14,27.27,30.53,...,33.37,30.59,33.23,30.78,33.35,31.08,33.72,31.26,33.97,31.45
2,서울특별시,29.65,27.25,29.88,27.52,30.12,27.78,30.51,28.02,30.89,...,33.72,31.55,33.61,31.6,33.85,31.91,34.17,32.15,34.38,32.42
3,부산광역시,29.43,26.74,29.68,27.04,29.95,27.26,30.35,27.6,30.61,...,33.54,31.04,33.39,31.08,33.4,31.3,33.94,31.67,34.31,31.95
4,대구광역시,29.1,26.51,29.43,26.77,29.65,27.09,29.9,27.33,30.3,...,33.36,30.62,33.08,30.67,33.32,31.03,33.63,31.22,33.71,31.43

### 사회적 요인: 교육정도별 혼인 연령 (구간)

In [8]:
df_s_2 = pd.read_csv("./data/사회_연령_교육정도별_혼인.csv")
df_s_2.head()

,연령별,교육정도별,2000,2000.1,2001,2001.1,2002,2002.1,2003,2003.1,...,2019,2019.1,2020,2020.1,2021,2021.1,2022,2022.1,2023,2023.1
0,연령별,교육정도별,남편,아내,남편,아내,남편,아내,남편,아내,...,남편,아내,남편,아내,남편,아내,남편,아내,남편,아내
1,20 - 24세,총계,24798,85675,21708,73536,18938,64851,16936,58407,...,5890,16182,4945,12516,4259,9985,4084,10113,3733,9588
2,20 - 24세,초등학교,334,550,302,470,229,335,178,389,...,38,100,15,55,20,53,17,48,10,48
3,20 - 24세,중학교,1846,2640,1582,2571,1311,2150,1203,2361,...,351,784,283,538,222,371,233,463,195,455
4,20 - 24세,고등학교,16694,53021,13977,43147,11936,36462,10104,31132,...,3595,7415,2964,5635,2578,4457,2332,4520,2219,4429

### 사회적 요인: 기사화(도시화률) 면적

In [9]:
df_s_3 = pd.read_csv("./data/사회_시가화면적.csv")
df_s_3.head()

,자치구별(1),자치구별(2),시가화면적별(1),시가화면적별(2),2003,2004,2005,2006,2007,2008,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,서울시,소계,행정구역면적 (㎢),소계,605.41,605.39,605.40,605.33,605.25,605.27,...,605.25,605.21,605.18,605.20,605.21,605.25,605.20,605.24,605.24,605.24
1,서울시,소계,시가화면적 현황,시가화면적 (㎢),354.13,355.77,357.56,358.19,358.66,361.13,...,362.51,363.13,363.23,366.13,365.63,370.99,371.20,371.20,371.50,371.54
2,서울시,소계,시가화면적 현황,시가화면적비율 (%),58.49,58.77,59.06,59.17,59.26,59.67,...,59.89,60.00,60.02,60.50,60.41,61.30,61.34,61.33,61.38,61.39
3,서울시,종로구,행정구역면적 (㎢),소계,23.91,23.91,23.91,23.91,23.91,23.91,...,23.91,23.91,23.91,23.91,23.91,23.91,23.91,23.91,23.91,23.91
4,서울시,종로구,시가화면적 현황,시가화면적 (㎢),12.57,12.71,12.71,12.71,12.71,12.71,...,12.71,12.71,12.71,12.71,12.71,12.77,12.77,12.77,12.77,12.77

## 타겟 변수: 출산률

In [11]:
df = pd.read_csv("./data/타겟_시군구_출생아수_합계출산율.csv")
df.head()

,시군구별,2000,2000.1,2001,2001.1,2002,2002.1,2003,2003.1,2004,...,2019,2019.1,2020,2020.1,2021,2021.1,2022,2022.1,2023,2023.1
0,시군구별,출생아수,합계출산율,출생아수,합계출산율,출생아수,합계출산율,출생아수,합계출산율,출생아수,...,출생아수,합계출산율,출생아수,합계출산율,출생아수,합계출산율,출생아수,합계출산율,출생아수,합계출산율
1,전국,640089,1.48,559934,1.309,496911,1.178,495036,1.191,476958,...,302676,0.918,272337,0.837,260562,0.808,249186,0.778,230028,0.721
2,서울특별시,133154,1.275,114764,1.111,102008,1.006,101227,1.014,99828,...,53673,0.717,47445,0.642,45531,0.626,42602,0.593,39456,0.552
3,부산광역시,41222,1.235,35848,1.103,30767,0.975,30117,0.988,28231,...,17049,0.827,15058,0.747,14446,0.728,14134,0.723,12866,0.664
4,대구광역시,32477,1.378,28111,1.216,24260,1.076,24513,1.116,23259,...,13233,0.932,11193,0.807,10661,0.785,10134,0.757,9410,0.702

# 타겟 데이터 정리
- 서울 데이터 필터링: 시군구별 열에서 서울특별시에 해당하는 데이터만 필터링.
- 긴(long) 형태로 변환: 연도별 데이터를 "Year", "출생아수(Births)", "합계출산율(Total_Fertility_Rate)"로 재구성.
- 데이터 타입 변환: 연도(Year), 출생아수(Births), 합계출산율(Total_Fertility_Rate)을 숫자형으로 변환.
- 컬럼명 변경: 한글 컬럼명을 영어로 변경(출생아수 → Births, 합계출산율 → Total_Fertility_Rate).

In [2]:
# Import required libraries
import pandas as pd

# Specify file paths
data_path = './data/타겟_시군구_출생아수_합계출산율.csv'  # Input file path
output_path = './out/birth_rate.csv'  # Output file path

# Read the CSV file
birth_data = pd.read_csv(data_path)

# Filter for Seoul only
seoul_data = birth_data[birth_data['시군구별'] == '서울특별시']

# Reshape to long format
long_format = seoul_data.melt(id_vars=['시군구별'], var_name='Year_Variable', value_name='Value')

# Extract Year and Variable
long_format['Year'] = long_format['Year_Variable'].str.extract(r'(\d{4})')  # Extract year
long_format['Variable'] = long_format['Year_Variable'].apply(lambda x: 'Births' if '.' not in x else 'Total_Fertility_Rate')

# Pivot data to create separate columns for Births and Total Fertility Rate
seoul_cleaned = long_format.pivot(index='Year', columns='Variable', values='Value').reset_index()

# Convert columns to numeric where appropriate
seoul_cleaned['Births'] = pd.to_numeric(seoul_cleaned['Births'], errors='coerce')
seoul_cleaned['Total_Fertility_Rate'] = pd.to_numeric(seoul_cleaned['Total_Fertility_Rate'], errors='coerce')

# Save the cleaned data to a new CSV file
seoul_cleaned.to_csv(output_path, index=False)

# Print a preview of the cleaned data
display(seoul_cleaned.head())
display(seoul_cleaned.info())   
display(seoul_cleaned.describe())

Variable  Year  Births  Total_Fertility_Rate
0         2000  133154                 1.275
1         2001  114764                 1.111
2         2002  102008                 1.006
3         2003  101227                 1.014
4         2004   99828                 1.015

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Year                  24 non-null     object
 1   Births                24 non-null     int64
 2   Total_Fertility_Rate  24 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 708.0+ bytes

None

Variable         Births  Total_Fertility_Rate
count         24.000000             24.000000
mean       82422.666667              0.920000
std        24249.273209              0.180977
min        39456.000000              0.552000
25%        63560.250000              0.817250
50%        90031.000000              0.981500
75%        96009.000000              1.014250
max       133154.000000              1.275000

# 고용임금 데이터 정리
- 불필요 행 제거: 첫 번째 행(설명용 행)을 삭제.
- 긴(long) 형태로 변환: 연도별 데이터를 "Year", "Monthly_Wage", "Gender", "Employment_Type"로 재구성.
- 데이터 타입 변환: 연도(Year)와 월임금(Monthly_Wage)을 숫자형으로 변환.
- 컬럼명 변경:
    - 고용형태 → Employment_Type
    - 성별 → Gender
- Gender 값 변경:
    - 전체 → A
    - 남 → M
    - 여 → F
- 필터링: Employment_Type가 전체근로자인 데이터에서 Gender 값이 A, M, F인 데이터만 추출.

In [6]:
# Full script to clean and transform the employment and wage data

# File paths
input_path_wage = './data/경제_성별_임금_및_근로시간.csv'
output_path_wage = './out/employment_wage_cleaned.csv'

employment_wage_data = pd.read_csv(input_path_wage)

# Drop the first row (header info) and reset index
employment_wage_data_cleaned = employment_wage_data.drop(0).reset_index(drop=True)

# Reshape the data into long format
long_format = employment_wage_data_cleaned.melt(
    id_vars=['고용형태', '성별'], 
    var_name='Year', 
    value_name='Monthly_Wage'
)

# Convert the year and wage to appropriate types
long_format['Year'] = pd.to_numeric(long_format['Year'], errors='coerce')
long_format['Monthly_Wage'] = pd.to_numeric(long_format['Monthly_Wage'], errors='coerce')

# Rename columns to English
long_format.rename(columns={
    '고용형태': 'Employment_Type',
    '성별': 'Gender'
}, inplace=True)

# Modify gender values
gender_mapping = {'전체': 'A', '남': 'M', '여': 'F'}
long_format['Gender'] = long_format['Gender'].map(gender_mapping)

# Filter for all employment types and genders
filtered_data_all = long_format[
    (long_format['Employment_Type'] == '전체근로자') &
    (long_format['Gender'].isin(['A', 'M', 'F']))
]

# Save the cleaned data with all genders included
filtered_data_all.to_csv(output_path_wage, index=False)

# Display a preview of the cleaned data
display(filtered_data_all.head())
display(filtered_data_all.info())   
display(filtered_data_all.describe())

  Employment_Type Gender  Year  Monthly_Wage
0           전체근로자      A  2006          2069
1           전체근로자      M  2006          2451
2           전체근로자      F  2006          1413
3           전체근로자      A  2007          2178
4           전체근로자      M  2007          2570

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Employment_Type  54 non-null     object
 1   Gender           54 non-null     object
 2   Year             54 non-null     int64
 3   Monthly_Wage     54 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.8+ KB

None

              Year  Monthly_Wage
count    54.000000     54.000000
mean   2014.500000   2673.666667
std       5.236843    695.662790
min    2006.000000   1413.000000
25%    2010.000000   2198.250000
50%    2014.500000   2687.000000
75%    2019.000000   3169.500000
max    2023.000000   4260.000000

# 주택 매매가격 데이터 정리
- 서울 데이터 필터링: 지역별(1) 열에서 "서울" 데이터만 추출.
- 긴(long) 형태 변환: 연도와 월을 포함한 데이터를 Year_Month에서 Year로 분리.
- 연 단위로 통합: 월별 데이터를 연 평균으로 계산하여 Year 기준으로 통합.
- 컬럼명 변경: Price_Index → Average_Housing_Price_Index.

In [8]:
# File paths
input_path_housing = './data/경제_유형별_매매가격지수.csv'
output_path_housing = './out/housing_price_index_cleaned.csv'

# Load the data
housing_price_data = pd.read_csv(input_path_housing)

# Filter for '서울' region only
seoul_data = housing_price_data[housing_price_data['지역별(1)'] == '서울']

# Reshape data from wide to long format
long_format = seoul_data.melt(
    id_vars=['주택유형별(1)', '지역별(1)'], 
    var_name='Year_Month', 
    value_name='Price_Index'
)

# Extract year from Year_Month and convert Price_Index to numeric
long_format['Year'] = long_format['Year_Month'].str.extract(r'^(\d{4})').astype(int)
long_format['Price_Index'] = pd.to_numeric(long_format['Price_Index'], errors='coerce')

# Aggregate by year using mean
yearly_data = long_format.groupby(['Year'], as_index=False)['Price_Index'].mean()

# Rename columns for clarity
yearly_data.rename(columns={'Price_Index': 'Average_Housing_Price_Index'}, inplace=True)

# Save the cleaned data
yearly_data.to_csv(output_path_housing, index=False)

# Display a preview of the cleaned data
display(yearly_data.head())
display(yearly_data.info())   
display(yearly_data.describe())

   Year  Average_Housing_Price_Index
0  2003                    55.403212
1  2004                    55.134055
2  2005                    55.830956
3  2006                    61.361342
4  2007                    71.960848

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 2 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Year                         22 non-null     int64
 1   Average_Housing_Price_Index  22 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 484.0 bytes

None

              Year  Average_Housing_Price_Index
count    22.000000                    22.000000
mean   2013.500000                    81.823362
std       6.493587                    14.343555
min    2003.000000                    55.134055
25%    2008.250000                    78.981645
50%    2013.500000                    83.117112
75%    2018.750000                    92.795506
max    2024.000000                   102.727267

# 주택 전세가격 데이터 정리

- 서울 데이터 필터링: 지역별(1) 열에서 "서울" 데이터를 필터링.
- 긴(long) 형태로 변환: 연도와 월별 데이터를 Year_Month로 변환 후, 연도(Year)만 추출.
- 연 단위로 통합: 월별 데이터를 연 평균으로 계산하여 Year 기준으로 통합.
- 컬럼명 변경: Price_Index를 Average_Rental_Price_Index로 변경하여 매매가격지수와 구분.

In [9]:
# Full script to process and aggregate rental price index data for logistic regression

# File paths
input_path_rental = './data/경제_유형별_전세가격지수.csv'
output_path_rental = './out/rental_price_index_cleaned.csv'

# Load the data
rental_price_data = pd.read_csv(input_path_rental)

# Filter for '서울' region only
seoul_rental_data = rental_price_data[rental_price_data['지역별(1)'] == '서울']

# Reshape data from wide to long format
long_format_rental = seoul_rental_data.melt(
    id_vars=['주택유형별(1)', '지역별(1)'], 
    var_name='Year_Month', 
    value_name='Price_Index'
)

# Extract year from Year_Month and convert Price_Index to numeric
long_format_rental['Year'] = long_format_rental['Year_Month'].str.extract(r'^(\d{4})').astype(int)
long_format_rental['Price_Index'] = pd.to_numeric(long_format_rental['Price_Index'], errors='coerce')

# Aggregate by year using mean
yearly_rental_data = long_format_rental.groupby(['Year'], as_index=False)['Price_Index'].mean()

# Rename columns for clarity
yearly_rental_data.rename(columns={'Price_Index': 'Average_Rental_Price_Index'}, inplace=True)

# Save the cleaned data
yearly_rental_data.to_csv(output_path_rental, index=False)

# Display a preview of the cleaned data
display(yearly_rental_data.head())
display(yearly_rental_data.info())   
display(yearly_rental_data.describe())

   Year  Average_Rental_Price_Index
0  2003                   55.157161
1  2004                   53.008825
2  2005                   50.489713
3  2006                   54.066264
4  2007                   58.727621

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 2 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Year                        22 non-null     int64
 1   Average_Rental_Price_Index  22 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 484.0 bytes

None

              Year  Average_Rental_Price_Index
count    22.000000                   22.000000
mean   2013.500000                   78.157795
std       6.493587                   17.321240
min    2003.000000                   50.489713
25%    2008.250000                   62.462434
50%    2013.500000                   81.481544
75%    2018.750000                   93.319064
max    2024.000000                  101.553151

# 성별 고용률 데이터 정리
- CSV 파일을 로드하고, 두 번째 행(인구_고용율) 설명 행을 제거.
- 월별 데이터 제거:
- 연도별 데이터 쌍으로 처리:

In [13]:
# File path
file_path = './data/경제_성별_고용률.csv'
output_path = './out/employment_population_cleaned.csv'

# Step 1: Load data and remove explanation row
data = pd.read_csv(file_path, header=None)
data = data.drop(index=1)  # Remove the explanation row
data.columns = data.iloc[0]  # Set the first row as column names
data = data[1:]  # Remove the header row

# Step 2: Filter relevant rows
data = data[data['년도'].isin(['남자', '여자'])]  # Keep only '남자' and '여자'

# Step 3: Remove monthly data
data = data.loc[:, ~data.columns.str.contains(r'\.')]  # Drop columns with '.'

# Step 4: Process yearly data
processed_data = []
columns = data.columns[1:]  # Exclude '년도'

for i in range(0, len(columns), 2):  # Process in pairs
    year = int(columns[i])  # Extract year from the column name
    population_col = columns[i]  # Left column is Population
    rate_col = columns[i + 1]  # Right column is Rate

    for idx, row in data.iterrows():
        # Correct value extraction using .at
        population_value = row.at[population_col]
        rate_value = row.at[rate_col]
        
        # Debug: Verify extracted values
        try:            
            population_value = float(population_value[0])
            rate_value = float(rate_value[1])
        except ValueError:
            print(f"Skipping invalid data: Population={population_value}, Rate={rate_value}")
            continue
        
        processed_data.append({
            'Year': year,
            'Gender': 'M' if row['년도'] == '남자' else 'F',
            'Population': population_value,
            'Rate': rate_value
        })

# Step 5: Convert to DataFrame
result_df = pd.DataFrame(processed_data)

# Step 6: Save the cleaned data
result_df.to_csv(output_path, index=False)

# Step 7: Display the cleaned data

display(result_df.head())
display(result_df.info())   
display(result_df.describe())

/var/folders/n1/2pqgm2x51q781rl2qnnxm34h0000gn/T/ipykernel_27852/138491763.py:33: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  population_value = float(population_value[0])
/var/folders/n1/2pqgm2x51q781rl2qnnxm34h0000gn/T/ipykernel_27852/138491763.py:34: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  rate_value = float(rate_value[1])

   Year Gender  Population  Rate
0  2000      M     17525.5  70.8
1  2000      F     18666.8  47.0
2  2001      M     17738.7  71.1
3  2001      F     18869.5  47.7
4  2002      M     17952.8  72.3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        48 non-null     int64
 1   Gender      48 non-null     object
 2   Population  48 non-null     float64
 3   Rate        48 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 1.6+ KB

None

              Year    Population       Rate
count    48.000000     48.000000  48.000000
mean   2011.500000  20628.445833  60.343750
std       6.995439   1582.962241  11.017142
min    2000.000000  17525.500000  47.000000
25%    2005.750000  19369.250000  48.975000
50%    2011.500000  20787.250000  61.950000
75%    2017.250000  22022.125000  71.200000
max    2023.000000  23045.200000  72.300000

# 출산율 데이터 + 경제적요인 4개 데이터 병합

데이터 병합:

- 출산률(birth_rate), 성별 고용율(employment_population), 고용 임금(employment_wage), 주택 매매 가격 지수(housing_price_index), 주택 전세 가격 지수(rental_price_index)를 Year와 Gender를 기준으로 병합.
- 컬럼명 변경:

컬럼명을 직관적으로 변경:
- Population → Population_15_Above
- Rate → Employment_Rate
- Monthly_Wage → Average_Monthly_Wage.

결측치 처리:
- 결측치가 포함된 모든 행 제거(dropna).

소수점 제한:
- Population_15_Above, Employment_Rate, Average_Monthly_Wage, Housing_Price_Index, Rental_Price_Index, Fertility_Rate를 소수점 3자리로 제한.

In [17]:
import pandas as pd
import os

data_path = './out/'

# File paths
file_birth_rate = data_path + 'birth_rate.csv'
file_employment_population = data_path + 'employment_population_cleaned.csv'
file_employment_wage = data_path + 'employment_wage_cleaned.csv'
file_housing_price_index = data_path + 'housing_price_index_cleaned.csv'
file_rental_price_index = data_path + 'rental_price_index_cleaned.csv'
output_path_cleaned = './cleaned/logistic_regression_ready_cleaned_data.csv'

# Step 1: Load all datasets
birth_rate = pd.read_csv(file_birth_rate)
employment_population = pd.read_csv(file_employment_population)
employment_wage = pd.read_csv(file_employment_wage)
housing_price_index = pd.read_csv(file_housing_price_index)
rental_price_index = pd.read_csv(file_rental_price_index)

# Step 2: Merge datasets
# Merge birth rate with gender-specific data (employment_population)
merged_data = employment_population.merge(
    birth_rate, on='Year', how='left'
)

# Add employment wage data
merged_data = merged_data.merge(
    employment_wage, on=['Year', 'Gender'], how='left'
)

# Add housing price index
merged_data = merged_data.merge(
    housing_price_index, on='Year', how='left'
)

# Add rental price index
merged_data = merged_data.merge(
    rental_price_index, on='Year', how='left'
)

# Step 3: Rename columns for clarity
merged_data.rename(columns={
    'Population': 'Population_15_Above',
    'Rate': 'Employment_Rate',
    'Monthly_Wage': 'Average_Monthly_Wage',
    'Average_Housing_Price_Index': 'Housing_Price_Index',
    'Average_Rental_Price_Index': 'Rental_Price_Index',
    'Total_Fertility_Rate': 'Fertility_Rate'
}, inplace=True)

# Step 4: Rearrange columns for logical order
merged_data = merged_data[[
    'Year', 'Gender', 'Population_15_Above', 'Employment_Rate',
    'Average_Monthly_Wage', 'Housing_Price_Index', 'Rental_Price_Index',
    'Births', 'Fertility_Rate'
]]

# Step 5: Drop rows with missing values
cleaned_data = merged_data.dropna()

numeric_columns = ['Population_15_Above', 'Employment_Rate', 'Average_Monthly_Wage',
                   'Housing_Price_Index', 'Rental_Price_Index', 'Fertility_Rate']
cleaned_data[numeric_columns] = cleaned_data[numeric_columns].round(3)

# Step 6: Save the cleaned dataset
cleaned_data.to_csv(output_path_cleaned, index=False)

# Display a success message and the first few rows
display(cleaned_data.head())
display(cleaned_data.info())   
display(cleaned_data.describe())

/var/folders/n1/2pqgm2x51q781rl2qnnxm34h0000gn/T/ipykernel_27852/77004157.py:64: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_data[numeric_columns] = cleaned_data[numeric_columns].round(3)

,Year,Gender,Population_15_Above,Employment_Rate,Average_Monthly_Wage,Housing_Price_Index,Rental_Price_Index,Births,Fertility_Rate
12,2006,M,18825.5,71.6,2451.0,61.361,54.066,93922,0.980
13,2006,F,19806.2,49.0,1413.0,61.361,54.066,93922,0.980
14,2007,M,19127.5,71.7,2570.0,71.961,58.728,101249,1.068
15,2007,F,20052.3,49.1,1524.0,71.961,58.728,101249,1.068
16,2008,M,19442.2,71.2,2700.0,80.802,62.400,94736,1.010

<class 'pandas.core.frame.DataFrame'>
Index: 36 entries, 12 to 47
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Year                  36 non-null     int64
 1   Gender                36 non-null     object
 2   Population_15_Above   36 non-null     float64
 3   Employment_Rate       36 non-null     float64
 4   Average_Monthly_Wage  36 non-null     float64
 5   Housing_Price_Index   36 non-null     float64
 6   Rental_Price_Index    36 non-null     float64
 7   Births                36 non-null     int64
 8   Fertility_Rate        36 non-null     float64
dtypes: float64(6), int64(2), object(1)
memory usage: 2.8+ KB

None

,Year,Population_15_Above,Employment_Rate,Average_Monthly_Wage,Housing_Price_Index,Rental_Price_Index,Births,Fertility_Rate
count,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000
mean,2014.500000,21306.916667,60.508333,2631.250000,85.344389,81.589000,74260.833333,0.873722
std,5.261722,1153.842128,10.686637,788.479962,10.040436,15.050457,20840.970751,0.173511
min,2006.000000,18825.500000,47.800000,1413.000000,61.361000,54.066000,39456.000000,0.552000
25%,2010.000000,20458.750000,50.000000,1939.250000,80.802000,67.374000,53673.000000,0.717000
50%,2014.500000,21486.950000,61.950000,2626.500000,83.851500,85.894000,83358.000000,0.965000
75%,2019.000000,22221.875000,71.125000,3230.750000,93.251000,93.856000,93266.000000,1.010000
max,2023.000000,23045.200000,71.700000,4260.000000,102.727000,101.553000,101249.000000,1.068000

# 초혼 연령 데이터 정리 

연도 및 부부구분 처리:
- 열 이름에서 연도(2000, 2001, ...)와 부부구분(남편, 아내)을 분리.
- 남편 → H, 아내 → W로 변환.

값 추출 및 데이터 정리:
- 남편과 아내 데이터를 한 쌍으로 처리:
- 연도(Year)별로 Spouse_Type(H/W)와 First_Marriage_Age로 정리.
- First_Marriage_Age를 소수점 2자리로 제한.

In [32]:
# File path
file_path = './data/사회_시도별_평균초혼연령.csv'
output_path = './out/first_marriage_age.csv'

# Step 1: Load and clean data
data = pd.read_csv(file_path, header=None)

# Step 2: Remove explanation row (second row)
data.columns = data.iloc[0]  # Set the first row as column names
data = data[2:]  # Remove the first two rows

# Step 3: Filter for 서울특별시
data = data[data['시도별'] == '서울특별시']

# Step 4: Reshape data
# Extract years and spouse types from column names
columns = data.columns[1:]  # Exclude '시도별'
years = [int(col.split()[0]) for col in columns[::2]]  # Extract unique years
husband_columns = columns[::2]  # Odd-indexed columns (남편)
wife_columns = columns[1::2]  # Even-indexed columns (아내)

# Create a DataFrame for the final output
processed_data = []

for year, h_col, w_col in zip(years, husband_columns, wife_columns):
    # Extract single values using .at or specific index    
    husband_age = float(data.at[data.index[0], h_col][0])  # Access first row and husband column
    wife_age = float(data.at[data.index[0], w_col][1])     # Access first row and wife column
    
    processed_data.append({'Year': year, 'Spouse_Type': 'H', 'First_Marriage_Age': husband_age})
    processed_data.append({'Year': year, 'Spouse_Type': 'W', 'First_Marriage_Age': wife_age})

# Convert to DataFrame
processed_df = pd.DataFrame(processed_data)

# Step 5: Round First_Marriage_Age to 2 decimal places
processed_df['First_Marriage_Age'] = processed_df['First_Marriage_Age'].round(2)

# Step 6: Save the processed data
processed_df.to_csv(output_path, index=False)

# Display the processed data
display(processed_df.head())
display(processed_df.info())   
display(processed_df.describe())

/var/folders/n1/2pqgm2x51q781rl2qnnxm34h0000gn/T/ipykernel_27852/3465286231.py:27: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  husband_age = float(data.at[data.index[0], h_col][0])  # Access first row and husband column
/var/folders/n1/2pqgm2x51q781rl2qnnxm34h0000gn/T/ipykernel_27852/3465286231.py:28: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  wife_age = float(data.at[data.index[0], w_col][1])     # Access first row and wife column

   Year Spouse_Type  First_Marriage_Age
0  2000           H               29.65
1  2000           W               27.25
2  2001           H               29.88
3  2001           W               27.52
4  2002           H               30.12

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                48 non-null     int64
 1   Spouse_Type         48 non-null     object
 2   First_Marriage_Age  48 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

None

              Year  First_Marriage_Age
count    48.000000           48.000000
mean   2011.500000           31.102292
std       6.995439            1.852084
min    2000.000000           27.250000
25%    2005.750000           29.865000
50%    2011.500000           31.240000
75%    2017.250000           32.425000
max    2023.000000           34.380000

# 교육정도별 혼인연령 데이터 정리 

데이터 변환:
- melt를 사용하여 데이터를 Year_Spouse, Marriage_Count 형식으로 변환.
- Year_Spouse에서 연도(Year)와 부부구분(남편/아내)을 추출.
- cumcount()를 사용하여 Spouse_Type을 결정:
- 0번째 값: H(남편).
- 1번째 값: W(아내).

컬럼명 변경 및 정리:
- 연령별 → Age_Group, 교육정도별 → Education_Level, Marriage_Count → Marriage_Count.
- 최종 데이터: Year, Spouse_Type, Age_Group, Education_Level, Marriage_Count.

In [62]:
# Corrected File path
file_path = './data/사회_연령_교육정도별_혼인.csv'
output_path = './out/processed_age_education_marriage_paired.csv'

# Step 1: Load data
data = pd.read_csv(file_path, header=None)

# Step 2: Remove explanation row (second row)
data.columns = data.iloc[0]  # Set the first row as column names
data = data[2:]  # Remove the first two rows

# Step 3: Remove rows where '교육정도별' is '총계'
data = data[data['교육정도별'] != '총계']

# Step 4: Reshape data to long format
data_long = data.melt(id_vars=['연령별', '교육정도별'], var_name='Year_Spouse', value_name='Marriage_Count')

data_long['Marriage_Count'] = data_long['Marriage_Count'].replace('-', 0).astype(float)


# Step 5: Extract year
data_long['Year'] = data_long['Year_Spouse'].str.extract(r'(\d{4})').astype(int)

# Determine spouse type by pairing based on order
data_long['Spouse_Type'] = data_long.groupby(['Year', '연령별', '교육정도별']).cumcount().map({0: 'H', 1: 'W'})

# Step 6: Rename columns for clarity
data_long.rename(columns={
    '연령별': 'Age_Group',
    '교육정도별': 'Education_Level',
    'Marriage_Count': 'Marriage_Count'
}, inplace=True)

# Step 7: Keep relevant columns and save data
processed_data = data_long[['Year', 'Spouse_Type', 'Age_Group', 'Education_Level', 'Marriage_Count']]
processed_data.to_csv(output_path, index=False)

# Display the processed data
print(processed_data["Spouse_Type"].value_counts())
print(processed_data[processed_data["Year"] == 2000])

display(processed_data)
display(processed_data.info())   
display(processed_data.describe())

Spouse_Type
H    480
W    480
Name: count, dtype: int64
    Year Spouse_Type Age_Group Education_Level  Marriage_Count
0   2000           H  20 - 24세            초등학교           334.0
1   2000           H  20 - 24세             중학교          1846.0
2   2000           H  20 - 24세            고등학교         16694.0
3   2000           H  20 - 24세           대학(교)             0.0
4   2000           H  20 - 24세          대학원 이상             0.0
5   2000           H  25 - 29세            초등학교           573.0
6   2000           H  25 - 29세             중학교          3268.0
7   2000           H  25 - 29세            고등학교         70346.0
8   2000           H  25 - 29세           대학(교)             0.0
9   2000           H  25 - 29세          대학원 이상             0.0
10  2000           H  30 - 34세            초등학교           875.0
11  2000           H  30 - 34세             중학교          3252.0
12  2000           H  30 - 34세            고등학교         36704.0
13  2000           H  30 - 34세           대학(교)             0.0
14  2000           H  30 - 34세          대학원 이상             0.0
15  2000           H  35 - 39세            초등학교          1455.0
16  2000           H  35 - 39세             중학교          3471.0
17  2000           H  35 - 39세            고등학교         12287.0
18  2000           H  35 - 39세           대학(교)             0.0
19  2000           H  35 - 39세          대학원 이상             0.0
20  2000           W  20 - 24세            초등학교           550.0
21  2000           W  20 - 24세             중학교          2640.0
22  2000           W  20 - 24세            고등학교         53021.0
23  2000           W  20 - 24세           대학(교)             0.0
24  2000           W  20 - 24세          대학원 이상             0.0
25  2000           W  25 - 29세            초등학교           546.0
26  2000           W  25 - 29세             중학교          2845.0
27  2000           W  25 - 29세            고등학교         73090.0
28  2000           W  25 - 29세           대학(교)             0.0
29  2000           W  25 - 29세          대학원 이상             0.0
30  2000           W  30 - 34세            초등학교           824.0
31  2000           W  30 - 34세             중학교          2780.0
32  2000           W  30 - 34세            고등학교         19504.0
33  2000           W  30 - 34세           대학(교)             0.0
34  2000           W  30 - 34세          대학원 이상             0.0
35  2000           W  35 - 39세            초등학교          1274.0
36  2000           W  35 - 39세             중학교          3325.0
37  2000           W  35 - 39세            고등학교          8833.0
38  2000           W  35 - 39세           대학(교)             0.0
39  2000           W  35 - 39세          대학원 이상             0.0

     Year Spouse_Type Age_Group Education_Level  Marriage_Count
0    2000           H  20 - 24세            초등학교           334.0
1    2000           H  20 - 24세             중학교          1846.0
2    2000           H  20 - 24세            고등학교         16694.0
3    2000           H  20 - 24세           대학(교)             0.0
4    2000           H  20 - 24세          대학원 이상             0.0
..    ...         ...       ...             ...             ...
955  2023           W  35 - 39세            초등학교           123.0
956  2023           W  35 - 39세             중학교           466.0
957  2023           W  35 - 39세            고등학교          4446.0
958  2023           W  35 - 39세           대학(교)         13752.0
959  2023           W  35 - 39세          대학원 이상          2472.0

[960 rows x 5 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 960 entries, 0 to 959
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             960 non-null    int64
 1   Spouse_Type      960 non-null    object
 2   Age_Group        960 non-null    object
 3   Education_Level  960 non-null    object
 4   Marriage_Count   960 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 37.6+ KB

None

              Year  Marriage_Count
count   960.000000      960.000000
mean   2011.500000     9397.226042
std       6.925795    17444.202019
min    2000.000000        0.000000
25%    2005.750000      174.750000
50%    2011.500000     1483.500000
75%    2017.250000    10762.250000
max    2023.000000   104717.000000

# 시가지역 면적 데이터 정리  
- 처리 내용 요약해줘. 시가확 면적비율만 추출

In [61]:
# File path
file_path = './data/사회_시가화면적.csv'
output_path = './out/seoul_urbanized_area_rate.csv'

# Step 1: Extract the third row (index 2, as Python is zero-based indexing)
urbanized_rate_row = data.iloc[2, 4:]  # Skip first two columns (non-year data)

print(urbanized_rate_row.iloc)

# Step 3: Create a DataFrame
urbanized_rate = pd.DataFrame({
    'Year': urbanized_rate_row.index.astype(int).astype(str),
    'Urbanized_Area_Rate': urbanized_rate_row.values.astype(float)
})

# Step 4: Save the processed data
urbanized_rate.to_csv(output_path, index=False)

# Display the processed data
urbanized_rate.head()

<pandas.core.indexing._iLocIndexer object at 0x313c4e940>

   Year  Urbanized_Area_Rate
0  2003                58.49
1  2004                58.77
2  2005                59.06
3  2006                59.17
4  2007                59.26